app/Controllers/Profile.php

    public function index(): string
    {
        $model = new UserModel();

        return view('profile/index', [
            'title' => 'Demo User Profile',
            'user' => $model->first(),
---
SELECT *
FROM `users`
 LIMIT 1