app/Controllers/Tasks.php

    public function index(): string
    {
        $model = new TaskModel();
        $today = date('Y-m-d');

        return view('tasks/welcome', [
            'title' => 'Tasks for Today',
            'tasks' => $model->where('task_date', $today)
                ->orderBy('created_at', 'ASC')
                ->findAll(),
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-28'
ORDER BY `created_at` ASC

    public function all(): string
    {
        $model = new TaskModel();

        return view('tasks/list', [
            'title' => 'Full Task List',
            'tasks' => $model->orderBy('task_date', 'ASC')
                ->orderBy('created_at', 'ASC')
                ->findAll(),
---
SELECT *
FROM `tasks`
ORDER BY `task_date` ASC, `created_at` ASC